Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
id          = (known after apply)
+           permissions = (known after apply)
+           type        = (known after apply)
+           uri         = (known after apply)
        }

+       lifecycle_rule {
+           abort_incomplete_multipart_upload_days = (known after apply)
+           enabled                                = (known after apply)
+           id                                     = (known after apply)
+           prefix                                 = (known after apply)
+           tags                                   = (known after apply)

+           expiration {
+               date                         = (known after apply)
+               days                         = (known after apply)
+               expired_object_delete_marker = (known after apply)
            }

+           noncurrent_version_expiration {
+               days = (known after apply)
            }

+           noncurrent_version_transition {
+               days          = (known after apply)
+               storage_class = (known after apply)
            }

+           transition {
+               date          = (known after apply)
+               days          = (known after apply)
+               storage_class = (known after apply)
            }
        }

+       logging {
+           target_bucket = (known after apply)
+           target_prefix = (known after apply)
        }

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       replication_configuration {
+           role = (known after apply)

+           rules {
+               delete_marker_replication_status = (known after apply)
+               id                               = (known after apply)
+               prefix                           = (known after apply)
+               priority                         = (known after apply)
+               status                           = (known after apply)

+               destination {
+                   account_id         = (known after apply)
+                   bucket             = (known after apply)
+                   replica_kms_key_id = (known after apply)
+                   storage_class      = (known after apply)

+                   access_control_translation {
+                       owner = (known after apply)
                    }

+                   metrics {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }

+                   replication_time {
+                       minutes = (known after apply)
+                       status  = (known after apply)
                    }
                }

+               filter {
+                   prefix = (known after apply)
+                   tags   = (known after apply)
                }

+               source_selection_criteria {
+                   sse_kms_encrypted_objects {
+                       enabled = (known after apply)
                    }
                }
            }
        }

+       server_side_encryption_configuration {
+           rule {
+               bucket_key_enabled = (known after apply)

+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }

+       website {
+           error_document           = (known after apply)
+           index_document           = (known after apply)
+           redirect_all_requests_to = (known after apply)
+           routing_rules            = (known after apply)
        }
    }

  # module.website_cdn.aws_s3_bucket_cors_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_cors_configuration" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       cors_rule {
+           allowed_headers = [
+               "*",
            ]
+           allowed_methods = [
+               "GET",
            ]
+           allowed_origins = [
+               "https://analytics.qa.loadsmart.com",
            ]
+           expose_headers  = [
+               "ETag",
            ]
+           max_age_seconds = 300
        }
    }

  # module.website_cdn.aws_s3_bucket_policy.ls-analytics-web will be created
+ resource "aws_s3_bucket_policy" "ls-analytics-web" {
+       bucket = (known after apply)
+       id     = (known after apply)
+       policy = (known after apply)
    }

  # module.website_cdn.aws_s3_bucket_website_configuration.ls-analytics-web will be created
+ resource "aws_s3_bucket_website_configuration" "ls-analytics-web" {
+       bucket           = (known after apply)
+       id               = (known after apply)
+       routing_rules    = (known after apply)
+       website_domain   = (known after apply)
+       website_endpoint = (known after apply)

+       error_document {
+           key = "index.html"
        }

+       index_document {
+           suffix = "index.html"
        }

+       routing_rule {
+           condition {
+               http_error_code_returned_equals = (known after apply)
+               key_prefix_equals               = (known after apply)
            }

+           redirect {
+               host_name               = (known after apply)
+               http_redirect_code      = (known after apply)
+               protocol                = (known after apply)
+               replace_key_prefix_with = (known after apply)
+               replace_key_with        = (known after apply)
            }
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_distribution.cdn will be created
+ resource "aws_cloudfront_distribution" "cdn" {
+       aliases                         = [
+           "analytics.qa.loadsmart.com",
        ]
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "ls-analytics-web - QA"
+       continuous_deployment_policy_id = (known after apply)
+       default_root_object             = "index.html"
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       price_class                     = "PriceClass_All"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = (known after apply)
+       tags_all                        = (known after apply)
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = true

+       custom_error_response {
+           error_code         = 404
+           response_code      = 200
+           response_page_path = "/index.html"
        }

+       default_cache_behavior {
+           allowed_methods        = [
+               "GET",
+               "HEAD",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 300
+           max_ttl                = 604800
+           min_ttl                = 0
+           target_origin_id       = "S3-ls-analytics-web"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "redirect-to-https"

+           forwarded_values {
+               headers                 = [
+                   "Access-Control-Request-Headers",
+                   "Access-Control-Request-Method",
+                   "Origin",
                ]
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = (known after apply)
+           origin_id           = "S3-ls-analytics-web"

+           s3_origin_config {
+               origin_access_identity = (known after apply)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           acm_certificate_arn            = (known after apply)
+           cloudfront_default_certificate = false
+           minimum_protocol_version       = "TLSv1"
+           ssl_support_method             = "sni-only"
        }
    }

  # module.website_cdn.module.site.aws_cloudfront_origin_access_identity.origin[0] will be created
+ resource "aws_cloudfront_origin_access_identity" "origin" {
+       caller_reference                = (known after apply)
+       cloudfront_access_identity_path = (known after apply)
+       comment                         = "Ls-Analytics-Web-Qa - QA"
+       etag                            = (known after apply)
+       iam_arn                         = (known after apply)
+       id                              = (known after apply)
+       s3_canonical_user_id            = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p qa`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.loadsmart.io/lock?id=loadsmart%252Fls-analytics-web%252Fterraform%252Fqa%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p qa`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
